7767517
75 77
Input                    input                    0 1 input
Convolution              Conv_0                   1 1 input 779 0=16 1=3 3=2 4=1 5=1 6=432
HardSwish                Div_8                    1 1 779 200 0=1.666667e-01
ConvolutionDepthWise     Conv_9                   1 1 200 782 0=16 1=3 4=1 5=1 6=144 7=16
HardSwish                Div_17                   1 1 782 210 0=1.666667e-01
Convolution              Conv_18                  1 1 210 785 0=32 1=1 5=1 6=512
HardSwish                Div_26                   1 1 785 220 0=1.666667e-01
ConvolutionDepthWise     Conv_27                  1 1 220 788 0=32 1=3 4=1 5=1 6=288 7=32
HardSwish                Div_35                   1 1 788 230 0=1.666667e-01
Convolution              Conv_36                  1 1 230 791 0=64 1=1 5=1 6=2048
HardSwish                Div_44                   1 1 791 240 0=1.666667e-01
ConvolutionDepthWise     Conv_45                  1 1 240 794 0=64 1=3 4=1 5=1 6=576 7=64
HardSwish                Div_53                   1 1 794 250 0=1.666667e-01
Convolution              Conv_54                  1 1 250 797 0=64 1=1 5=1 6=4096
HardSwish                Div_62                   1 1 797 260 0=1.666667e-01
ConvolutionDepthWise     Conv_63                  1 1 260 800 0=64 1=3 13=2 4=1 5=1 6=576 7=64
HardSwish                Div_71                   1 1 800 270 0=1.666667e-01
Convolution              Conv_72                  1 1 270 803 0=128 1=1 5=1 6=8192
HardSwish                Div_80                   1 1 803 280 0=1.666667e-01
ConvolutionDepthWise     Conv_81                  1 1 280 806 0=128 1=3 4=1 5=1 6=1152 7=128
HardSwish                Div_89                   1 1 806 290 0=1.666667e-01
Convolution              Conv_90                  1 1 290 809 0=128 1=1 5=1 6=16384
HardSwish                Div_98                   1 1 809 300 0=1.666667e-01
ConvolutionDepthWise     Conv_99                  1 1 300 812 0=128 1=3 13=2 4=1 5=1 6=1152 7=128
HardSwish                Div_107                  1 1 812 310 0=1.666667e-01
Convolution              Conv_108                 1 1 310 815 0=256 1=1 5=1 6=32768
HardSwish                Div_116                  1 1 815 320 0=1.666667e-01
ConvolutionDepthWise     Conv_117                 1 1 320 818 0=256 1=5 4=2 5=1 6=6400 7=256
HardSwish                Div_125                  1 1 818 330 0=1.666667e-01
Convolution              Conv_126                 1 1 330 821 0=256 1=1 5=1 6=65536
HardSwish                Div_134                  1 1 821 340 0=1.666667e-01
ConvolutionDepthWise     Conv_135                 1 1 340 824 0=256 1=5 4=2 5=1 6=6400 7=256
HardSwish                Div_143                  1 1 824 350 0=1.666667e-01
Convolution              Conv_144                 1 1 350 827 0=256 1=1 5=1 6=65536
HardSwish                Div_152                  1 1 827 360 0=1.666667e-01
ConvolutionDepthWise     Conv_153                 1 1 360 830 0=256 1=5 4=2 5=1 6=6400 7=256
HardSwish                Div_161                  1 1 830 370 0=1.666667e-01
Convolution              Conv_162                 1 1 370 833 0=256 1=1 5=1 6=65536
HardSwish                Div_170                  1 1 833 380 0=1.666667e-01
ConvolutionDepthWise     Conv_171                 1 1 380 836 0=256 1=5 4=2 5=1 6=6400 7=256
HardSwish                Div_179                  1 1 836 390 0=1.666667e-01
Convolution              Conv_180                 1 1 390 839 0=256 1=1 5=1 6=65536
HardSwish                Div_188                  1 1 839 400 0=1.666667e-01
ConvolutionDepthWise     Conv_189                 1 1 400 842 0=256 1=5 4=2 5=1 6=6400 7=256
HardSwish                Div_197                  1 1 842 410 0=1.666667e-01
Convolution              Conv_198                 1 1 410 845 0=256 1=1 5=1 6=65536
HardSwish                Div_206                  1 1 845 420 0=1.666667e-01
ConvolutionDepthWise     Conv_207                 1 1 420 848 0=256 1=5 13=2 4=2 5=1 6=6400 7=256
HardSwish                Div_215                  1 1 848 430 0=1.666667e-01
Split                    splitncnn_0              1 2 430 430_splitncnn_0 430_splitncnn_1
Pooling                  GlobalAveragePool_216    1 1 430_splitncnn_1 431 0=1 4=1
InnerProduct             Conv_217                 1 1 431 433 0=64 1=1 2=16384 9=1
InnerProduct             Conv_219                 1 1 433 434 0=256 1=1 2=16384
HardSigmoid              Div_226                  1 1 434 441 0=1.666667e-01
BinaryOp                 Mul_227                  2 1 430_splitncnn_0 441 442 0=2
Convolution              Conv_228                 1 1 442 851 0=512 1=1 5=1 6=131072
HardSwish                Div_236                  1 1 851 452 0=1.666667e-01
ConvolutionDepthWise     Conv_237                 1 1 452 854 0=512 1=5 4=2 5=1 6=12800 7=512
HardSwish                Div_245                  1 1 854 462 0=1.666667e-01
Split                    splitncnn_1              1 2 462 462_splitncnn_0 462_splitncnn_1
Pooling                  GlobalAveragePool_246    1 1 462_splitncnn_1 463 0=1 4=1
InnerProduct             Conv_247                 1 1 463 465 0=128 1=1 2=65536 9=1
InnerProduct             Conv_249                 1 1 465 466 0=512 1=1 2=65536
HardSigmoid              Div_256                  1 1 466 473 0=1.666667e-01
BinaryOp                 Mul_257                  2 1 462_splitncnn_0 473 474 0=2
Convolution              Conv_258                 1 1 474 857 0=512 1=1 5=1 6=262144
HardSwish                Div_266                  1 1 857 484 0=1.666667e-01
Pooling                  MaxPool_267              1 1 484 485 1=2 2=2 5=1
Reshape                  Reshape_281              1 1 485 499 0=-1 1=512
Permute                  Transpose_289            1 1 499 511 0=1
LSTM                     LSTM_298                 1 1 511 641 0=64 1=262144 2=2
LSTM                     LSTM_310                 1 1 641 771 0=64 1=65536 2=2
InnerProduct             MatMul_315               1 1 771 774 0=96 1=1 2=12288
InnerProduct             MatMul_317               1 1 774 777 0=6625 1=1 2=636000
Softmax                  Softmax_319              1 1 777 out 0=1 1=1
